zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/svd/PIC32CZ2038CA70064.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PWMC0</name>
         <version>6343Y</version>
         <description>Pulse Width Modulation Controller</description>
         <groupName>PWMC</groupName>
         <prependToName>PWMC_</prependToName>
         <baseAddress>0x40020000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x464</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PWMC0</name>
            <value>31</value>
         </interrupt>
         <registers>
            <register>
               <name>PWMC_CLK</name>
               <description>PWMC Clock Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DIVA</name>
                     <description>CLKA Divide Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CLKA_POFF</name>
                           <description>CLKA clock is turned off</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PREA</name>
                           <description>CLKA clock is clock selected by PREA</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PREA</name>
                     <description>CLKA Source Clock Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CLK</name>
                           <description>Peripheral clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV2</name>
                           <description>Peripheral clock/2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV4</name>
                           <description>Peripheral clock/4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV8</name>
                           <description>Peripheral clock/8</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV16</name>
                           <description>Peripheral clock/16</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV32</name>
                           <description>Peripheral clock/32</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV64</name>
                           <description>Peripheral clock/64</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV128</name>
                           <description>Peripheral clock/128</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV256</name>
                           <description>Peripheral clock/256</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV512</name>
                           <description>Peripheral clock/512</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV1024</name>
                           <description>Peripheral clock/1024</description>
                           <value>0xA</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIVB</name>
                     <description>CLKB Divide Factor</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CLKB_POFF</name>
                           <description>CLKB clock is turned off</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PREB</name>
                           <description>CLKB clock is clock selected by PREB</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PREB</name>
                     <description>CLKB Source Clock Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CLK</name>
                           <description>Peripheral clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV2</name>
                           <description>Peripheral clock/2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV4</name>
                           <description>Peripheral clock/4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV8</name>
                           <description>Peripheral clock/8</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV16</name>
                           <description>Peripheral clock/16</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV32</name>
                           <description>Peripheral clock/32</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV64</name>
                           <description>Peripheral clock/64</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV128</name>
                           <description>Peripheral clock/128</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV256</name>
                           <description>Peripheral clock/256</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV512</name>
                           <description>Peripheral clock/512</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV1024</name>
                           <description>Peripheral clock/1024</description>
                           <value>0xA</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_ENA</name>
               <description>PWMC Enable Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Channel ID</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Channel ID</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Channel ID</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_DIS</name>
               <description>PWMC Disable Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Channel ID</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Channel ID</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Channel ID</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_SR</name>
               <description>PWMC Status Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Channel ID</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Channel ID</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Channel ID</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_IER1</name>
               <description>PWMC Interrupt Enable Register 1</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Counter Event on Channel 0 Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Counter Event on Channel 1 Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Counter Event on Channel 2 Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Counter Event on Channel 3 Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID0</name>
                     <description>Fault Protection Trigger on Channel 0 Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID1</name>
                     <description>Fault Protection Trigger on Channel 1 Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID2</name>
                     <description>Fault Protection Trigger on Channel 2 Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID3</name>
                     <description>Fault Protection Trigger on Channel 3 Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_IDR1</name>
               <description>PWMC Interrupt Disable Register 1</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Counter Event on Channel 0 Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Counter Event on Channel 1 Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Counter Event on Channel 2 Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Counter Event on Channel 3 Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID0</name>
                     <description>Fault Protection Trigger on Channel 0 Interrupt Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID1</name>
                     <description>Fault Protection Trigger on Channel 1 Interrupt Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID2</name>
                     <description>Fault Protection Trigger on Channel 2 Interrupt Disable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID3</name>
                     <description>Fault Protection Trigger on Channel 3 Interrupt Disable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_IMR1</name>
               <description>PWMC Interrupt Mask Register 1</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Counter Event on Channel 0 Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Counter Event on Channel 1 Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Counter Event on Channel 2 Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Counter Event on Channel 3 Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID0</name>
                     <description>Fault Protection Trigger on Channel 0 Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID1</name>
                     <description>Fault Protection Trigger on Channel 1 Interrupt Mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID2</name>
                     <description>Fault Protection Trigger on Channel 2 Interrupt Mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID3</name>
                     <description>Fault Protection Trigger on Channel 3 Interrupt Mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_ISR1</name>
               <description>PWMC Interrupt Status Register 1</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Counter Event on Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Counter Event on Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Counter Event on Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Counter Event on Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID0</name>
                     <description>Fault Protection Trigger on Channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID1</name>
                     <description>Fault Protection Trigger on Channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID2</name>
                     <description>Fault Protection Trigger on Channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID3</name>
                     <description>Fault Protection Trigger on Channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
